[
  {
    "event_banner_drawable":"event_posterfifa",
    "event_name": "FIFA",
    "event_short_desc": "90 Minutes. One Objective.\nScore more than the opposition",
    "event_long_desc": "Since this is a gaming event each participant has to play a stand alone match. Gamers are allowed to bring controllers with them. Round 2 will be strictly played on wcg rule so gear up urself for round 2 to be a part of it.",
    "event_prize_worth": "Will be updated...",
    "event_reg_fees": "•Local Students: INR 40/-\n•Others: INR 60/-",
    "event_max_member": "1",
    "event_min_member": "1",
    "event_contact_name1": "Member Name 1",
    "event_contact_number1": "0000000000",
    "event_contact_name2": "Member Name 1",
    "event_contact_number2": "0000000000",
    "event_rule_list":
    [
      {"rule_title": "Rules and Regulations :","rule_desc":"1.The players are not allowed to shoot the ball directly onto the crossbar from a corner kick in order to get a chance for a header when the ball rebounds or score directly from corner.\n\n2.It is not allowed to score a goal from one's own half of the field.\n\n3.It is forbidden to make a throw-in directly into the opponent's penalty area. Should a player throw the ball directly into the opponent's penalty area he shall be warned. Should he persist, he shall be disqualified from the tournament.\n\n4.Any goals resulting from a throw-in into the opponent's penalty area will not be counted.\n\n5.If a player changes his tactics, formation or line-up he has to kick the ball out of bounds after the changes so that his opponent is able to react.\n\n6.If a player is found to be intentionally delaying the game time by passing the ball around and clearly not attempting to score, he may be given a warning or lose by default at the referee's discretion.\n\n7.Prior to making any changes to one's team, the player that wants to make a change must be in possession of the ball and be in his own half before he pauses the game. In the last few minutes of the game it is not allowed to make any changes to one's team with the sole intent of delaying the match. Should this be the case, the player delaying the match will be warned by a referee and, should he persist after the warning, be attributed with a default loss of the match.\n\n8.In any case, a goal scored due to the use of a 'forbidden move' shall not be counted.\n\n9.Should a player persist in playing with forbidden moves, he may be disqualified from the tournament.\n\n10.All complaints shall be dealt with after the match has been completed.\n\n11.Disconnection: Any connection loss between opponents due to system, network, PC, and/or power problems/issues.\n\n12.Set pieces are available. Man Marking is allowed. No forward pass at kick-off, you must back pass the ball.\n\n13.You can choose your preferred controls; Manual, Semi or Assisted. Tactical defending mode only. Controllers are supplied by PLG. It is the responsibility of all Players to be familiar with the controller’s functions and mode of operation. If a controller is defective, a Player can pause the game and notify the referee once only, if the player agrees the problem is fixed he may not pause again.\n\n14.Extra Time: extra time of two one (1) minute halves will be played in the event of a draw after regulation. Penalties will decide the winner if after extra time the scores are level.\n\n15. Goal Keeper: World Class Injuries: Off \nBookings: On \nReferee: Random\nCamera Settings: Tele Broadcast\nTime of the Day: Night\nHome Team: Coin toss will decide. Half: 4mins Groups\nHalf: 4mins Knock Out\nHalf: Bo3 6mins Qs to Final (depending on tournament)\nHandball: Off\nTime/Score display: On\nHUD: Player Name Bar\nOffside: On\nCamera: Tele Broadcast\nRadar: 2D\nDefense type: Tactical only\nPitch Wear: None\nStadium: Neutral\nGoalkeeper Control: Yes"}
    ]
  },
  {
    "event_banner_drawable":"event_postercoc",
    "event_name": "COC",
    "event_short_desc": "There is no good or bad in this world,\nthere are just people whose intentions and clans clash",
    "event_long_desc": "Hey chief! Welcome! To our clan, we've been waiting for you. Techstorm 2.20 brings you the opportunity to show off your skills and to prove to the Clashing Universe that you are the best in the business! So get your armies trained, your heroes healed up to go for the win because we believe that an epic win is possible and that it's always worth trying. CLASH ON!!",
    "event_prize_worth": "Will be updated...",
    "event_reg_fees": "•Local Students: INR 30/-\n•Others: INR 50/-",
    "event_max_member": "1",
    "event_min_member": "1",
    "event_contact_name1": "Member Name 1",
    "event_contact_number1": "0000000000",
    "event_contact_name2": "Member Name 1",
    "event_contact_number2": "0000000000",
    "event_rule_list":
    [
      {"rule_title": "Rules:","rule_desc":"1. Townhall 7 to Townhall 9 only.\n\n2. Mod or any other 3rd party softwares are not allowed.\n\n3. One entry per person.\n\n4. Coordinators will not provide any sort of internet connection.\n\n5. In case of any conflict, the decision of the coordinator will be final.\n\n6. Breaking of any rules will lead to immediate disqualification.\n\n7. Clan troops/spells are not allowed during the event whether it is used as attacking or defending the village.\n\n8. There will be no use of magic items(such as using potion which boosts the army and spells to a max level) and siege machines."}
    ]
  },
  {
    "event_banner_drawable":"event_posterkhet",
    "event_name": "KHET",
    "event_short_desc": "The blunders are all there on the board, waiting to be made. When you see a good move, look for a better one.",
    "event_long_desc": "Khet (a.k.a. Deflexion) is a chess-like board game that has two built in lasers and movable Egyptian-themed game pieces that have embedded mirrors that can be positioned to bounce the laser light around the board and hit opponent pieces.To play, players alternate moving their pieces around the board. Some pieces have mirrors and some do not. Bounding the board is a raised frame into which are built two low-power lasers, one for each player. The game pieces include a 'pharaoh', obelisks, and pyramids with mirrors. After each move, a player must press the button on his/her laser. The beam bounces from mirror to mirror around the playing field. The challenge is to protect one's own pharaoh while maneuvering to 'light up' the opposing player's pharaoh.",
    "event_prize_worth": "Will be updated...",
    "event_reg_fees": "•Local Students: INR .../-\n•Others: INR .../-",
    "event_max_member": "1",
    "event_min_member": "1",
    "event_contact_name1": "Member Name 1",
    "event_contact_number1": "0000000000",
    "event_contact_name2": "Member Name 1",
    "event_contact_number2": "0000000000",
    "event_rule_list":
    [
      {"rule_title": "Rules:\n\nPRELIMS-I:","rule_desc":"1.Two Players will be in one set at a time.\n\n2. In each turn player will get max 2 minutes for next 30 seconds (-1) will be added and for next 30 seconds another (-1) will be added.\n\n3. If he/she does not make any move in stipulated time then and there he/she will be eliminated and opponent shall be declared as winner.\n\n4.For each warning (-3) will be added for breaking any rule( i.e. touching mirror, rotate pyramid more than 45 degree, rotate and then move element). After getting 3 warnings participant will be then and there eliminated.\n\n5. Marks division: Pyramid (5), Anubis (10), Rule breaking (-3)\n\n6. If participant hits his/her own element then the corresponding marks will be deducted.\n\n7. If the total game time exceeds 15 minutes then another 5 minutes will be given to end the game. In this case no marks will be deducted from any participant but they will be warned.\n\n8. If the match will tie then marks will be considered and if marks will also happen to be same then total time taken will be considered."},
      {"rule_title": "PRELIMS-II:","rule_desc":"Time limit for each move will be 1.5 minutes and after that he/she will be given another 1 min to move."},
      {"rule_title": "Quarter final, Semifinal & Final :","rule_desc":"1. In each turn player will get max 2 minutes for next 30 seconds (-1) will be added and for next 30 seconds another (-1) will be added.\n\n2. There is no total time limit for entire game."},
	  {"rule_title": "Setups:","rule_desc":"Prelims: Classic\nQuarter final: Dynasty\nSemifinal &amp; Final: Imhotep"}
    ]
  },
  {
    "event_banner_drawable":"event_posternfs",
    "event_name": "NFS",
    "event_short_desc": "...",
    "event_long_desc": "...",
    "event_prize_worth": "Will be updated...",
    "event_reg_fees": "•Local Students: INR .../-\n•Others: INR .../-",
    "event_max_member": "1",
    "event_min_member": "1",
    "event_contact_name1": "Member Name 1",
    "event_contact_number1": "0000000000",
    "event_contact_name2": "Member Name 1",
    "event_contact_number2": "0000000000",
    "event_rule_list":
    [
      {"rule_title": "NFS MOST WANTED COMPETITION RULES","rule_desc":"Game Version : NFS Most Wanted 1.3\n\nGeneral Competition Method : 4 players"},
      {"rule_title": "COMPETITION STRUCTURE","rule_desc":"First day of the event : Preliminaries\n\nSecond day of the event : Main Tournament"},
      {"rule_title": "RULES FOR PRELIMINARIES","rule_desc":"Game Type : Circuit , Sprint\n\nThe Circuit is for 2 rounds.\n\nPlayers getting the 1 st position shall qualify for the next round."},
      {"rule_title": "RULES FOR THE TOURNAMENT","rule_desc":"1.The tournament will be knock out.\n\n2.The player who wins there 1 st stage match advances to the next stage.\n\n3.There will not be any match played for the third spot."},
      {"rule_title": "GAME SETTING","rule_desc":"1.Courses: Course selection is done by the game administrator.\n\n2.Car settings : All cars are available.\n\n3.Race Mode Options :\n*Nitrous : On\n*Collision Detection : On\n*Performance Matching : Off\n*Units : Players own discretion\n\n4.Player Mode Options :\n*Game Moment Camera : Off\n*Car Damage : Off\n*Rear View Mirror : Player’s own discretion\n\n5.Players are provided with a standard keyboard and mouse.Other controllers and Steering Wheels are not allowed."},
      {"rule_title": "PENALTY FOR UNFAIR PLAY","rule_desc":" Unfair Play\n\n Use of any cheat program\n\n Intentional disconnection\n\n Use of any settings exceeding standard and permitted settings.\n\n\nIf the match is disrupted due to unnecessary chatting,the players may be given a warning or lose by default at the referee’s sole discretion.\n\nUpon discovery of any player committing any violations regarded as unfair play that player will be disqualified from the tournament preliminaries.\n\nDuring the course of any match , the operations staff or referee may determine other actions to be unfair play at any time.\n\nTwo warnings constitute being disqualified from the tournament Preliminaries."}
    ]
  }
]
